export type Item = {  name: string; disabled?: boolean; };
export type Group = {
    name: string;
    items: Item[];
    disabled?: boolean;
    picked?: boolean;
};

export const packs: Group[] = [
    {
        "name": "Это база!",
        "items": [
            {
                "name": "Alias 2017 (изи)"
            },
            {
                "name": "Alias 2017 (нормал)"
            },
            {
                "name": "Alias 2017 (хард)"
            }
        ]
    },
    {
        "name": "Очень глубокий",
        "items": [
            {
                "name": "Что за цвет?"
            },
            {
                "name": "Англицизмы"
            },
            {
                "name": "Бренды"
            }
        ]
    },
    {
        "name": "Начну с понедельника",
        "items": [
            {
                "name": "Хоккейные клубы 🏒"
            },
            {
                "name": "Футболисты"
            },
            {
                "name": "Шахматы"
            }
        ]
    },
    {
        "name": "Чукча не читатель",
        "items": [
            {
                "name": "Писатели (изи)"
            },
            {
                "name": "Литература (изи)"
            },
            {
                "name": "Гарри Поттер"
            }
        ]
    },
    {
        "name": "Я - аниме",
        "items": [
            {
                "name": "Персонажи мультфильмов и мультсериалов"
            },
            {
                "name": "Персонажи видеоигр"
            },
            {
                "name": "Персонажи фильмов и книг"
            }
        ]
    },
    {
        "name": "Опаньки и произошло",
        "items": [
            {
                "name": "Аниме (1985 - 2020 гг)"
            },
            {
                "name": "Сериалы"
            },
            {
                "name": "Персонажи комиксов"
            }
        ]
    },
    {
        "name": "Меня зовут Авас, а вас?",
        "items": [
            {
                "name": "Исторические персоны (нормал)"
            },
            {
                "name": "Славянские имена"
            },
            {
                "name": "Известные Люди"
            }
        ]
    },
    {
        "name": "Мировой кризис",
        "items": [
            {
                "name": "Алкопак"
            },
            {
                "name": "Еда"
            },
            {
                "name": "2007"
            }
        ]
    },
    {
        "name": "Нахуй алиас",
        "items": [
            {
                "name": "Minecraft"
            },
            {
                "name": "Path of Exile"
            },
            {
                "name": "Dota (eng)"
            }
        ]
    },
    {
        "name": "Привет соседям",
        "items": [
            {
                "name": "Оксипак"
            },
            {
                "name": "Музыкалочка"
            },
            {
                "name": "Классическая музыка"
            }
        ]
    },
    {
        "name": "Ученые в говне моченые",
        "items": [
            {
                "name": "Астрономия"
            },
            {
                "name": "Философия"
            },
            {
                "name": "Числа"
            }
        ]
    },
    {
        "name": "Я не лицемер",
        "items": [
            {
                "name": "Пак для гуманитариев"
            },
            {
                "name": "Пак не по доте"
            },
            {
                "name": "Пак не по словам"
            }
        ]
    },
    {
        "name": "Пойдем на север!Нет на юг!",
        "items": [
            {
                "name": "География (изи)"
            },
            {
                "name": "География (нормал)"
            },
            {
                "name": "Московский Метрополитен"
            }
        ]
    },
    {
        "name": "Крокодил-нарвал",
        "items": [
            {
                "name": "Глаголы"
            },
            {
                "name": "Наречия"
            },
            {
                "name": "Дефисы"
            }
        ]
    }
];